% Married characters
married("Владимир Павлович Шуст").
married("Татьяна Петровна Шуст").
married("Иван Владимирович Шуст").
married("Арина Александровна Шуст").
married("Елена Петровна Исмаилова").
married("Дмитрий Дмитриевич Исмаилов").
married("Антонина Павловна Адамова").
married("Петр Михаилович Адамов").
married("Варвара Игнатова Адамова").
married("Михаил Григорьевич Адамов").
married("Игорь Александрович Федоров").
married("Алла Павловна Федорова").
married("Евгения Евдокимовна Шуст").
married("Павел Дмитриевич Шуст").
married("Елизавета Карловна Шуст").
married("Дмитрий Константинович Шуст").
married("Даниил Карлович Куранов").
married("Дарья Владимировна Куранова").
married("Карл Куранов").
married("Валентина Сергеевна Куранова").

% Bachelors
bachelor("Николай Михаилович Адамов").
bachelor("Сергей Игоревич Федоров").
bachelor("Кирилл Игоревич Федоров").
bachelor("Эльчин Дмитриевич Исмаилов").
bachelor("Леонид Даниилович Куранов").

% Bachelorettes
bachelorette("Алена Михайловна Адамова").
bachelorette("Марья Владимировна Шуст").
bachelorette("Екатерина Данииловна Куранова").
bachelorette("Анна Игоревна Федорова").

% Spouse relationships 
spouse("Варвара Игнатова Адамова", "Михаил Григорьевич Адамов", 15.03.1949).
spouse("Антонина Павловна Адамова", "Петр Михаилович Адамов", 11.11.1972).
spouse("Елена Петровна Исмаилова", "Дмитрий Дмитриевич Исмаилов", 03.09.1999).
spouse("Татьяна Петровна Шуст", "Владимир Павлович Шуст", 24.08.1996).
spouse("Арина Александровна Шуст", "Иван Владимирович Шуст", 31.07.2024).
spouse("Алла Павловна Федорова", "Игорь Александрович Федоров", 20.08.1988).
spouse("Евгения Евдокимовна Шуст", "Павел Дмитриевич Шуст", 08.09.1970).
spouse("Елизавета Карловна Шуст", "Дмитрий Константинович Шуст", 30.05.1938).
spouse("Валентина Сергеевна Куранова", "Карл Куранов", 23.06.1926).
spouse("Дарья Владимировна Куранова", "Даниил Карлович Куранов", 03.07.1946).

% Dead
dead("Ярослав Владимирович Белый", 10.10.1923).
dead("Антонина Павловна Адамова", 09.05.2000).
dead("Петр Михаилович Адамов", 15.04.2020).
dead("Варвара Игнатова Адамова", 21.04.2004).
dead("Михаил Григорьевич Адамов", 14.01.2005).
dead("Евгения Евдокимовна Шуст", 16.06.2009).
dead("Павел Дмитриевич Шуст", 27.05.2021).
dead("Екатерина Данииловна Куранова", 13.07.2006).
dead("Леонид Даниилович Куранов", 17.01.2013).
dead("Елизавета Карловна Шуст", 18.03.2001).
dead("Дмитрий Константинович Шуст", 15.01.1999).
dead("Даниил Карлович Куранов", 03.08.2003).
dead("Дарья Владимировна Куранова", 13.09.2008).
dead("Захар Иванович Курдюков", 21.09.1941).
dead("Карл Куранов", 29.03.1950).
dead("Валентина Сергеевна Куранова", 01.08.1973).

% Born
born("Ярослав Владимирович Белый", 07.09.1881).
born("Захар Иванович Курдюков", 02.03.1905).
born("Николай Михаилович Адамов", 31.12.1955).
born("Сергей Игоревич Федоров", 11.09.1986).
born("Кирилл Игоревич Федоров", 16.07.1994).
born("Эльчин Дмитриевич Исмаилов", 02.02.2000).
born("Леонид Даниилович Куранов", 18.03.1939).
born("Алена Михайловна Адамова", 07.04.1957).
born("Марья Владимировна Шуст", 17.07.2005).
born("Екатерина Данииловна Куранова", 24.06.1934).
born("Анна Игоревна Федорова", 12.03.1991).
born("Владимир Павлович Шуст", 03.09.1971).
born("Татьяна Петровна Шуст", 16.11.1973).
born("Иван Владимирович Шуст", 17.09.1999).
born("Арина Александровна Шуст", 17.08.1999).
born("Елена Петровна Исмаилова", 24.09.1978).
born("Дмитрий Дмитриевич Исмаилов", 15.03.1976).
born("Антонина Павловна Адамова", 20.09.1952).
born("Петр Михаилович Адамов", 21.11.1955).
born("Варвара Игнатова Адамова", 03.05.1929).
born("Михаил Григорьевич Адамов", 20.06.1929).
born("Игорь Александрович Федоров", 27.01.1965).
born("Алла Павловна Федорова", 20.09.1967).
born("Евгения Евдокимовна Шуст", 20.08.1939).
born("Павел Дмитриевич Шуст", 21.06.1939).
born("Елизавета Карловна Шуст", 11.05.1913).
born("Дмитрий Константинович Шуст", 18.02.1910).
born("Даниил Карлович Куранов", 19.04.1908).
born("Дарья Владимировна Куранова", 11.05.1912).
born("Карл Куранов", 19.07.1885).
born("Валентина Сергеевна Куранова", 20.12.1889).

% Parent relationships
parent("Татьяна Петровна Шуст", "Марья Владимировна Шуст").
parent("Татьяна Петровна Шуст", "Иван Владимирович Шуст").
parent("Елена Петровна Исмаилова", "Эльчин Дмитриевич Исмаилов").
parent("Михаил Григорьевич Адамов", "Николай Михаилович Адамов").
parent("Михаил Григорьевич Адамов", "Алена Михайловна Адамова").
parent("Михаил Григорьевич Адамов", "Петр Михаилович Адамов").
parent("Антонина Павловна Адамова", "Татьяна Петровна Шуст").
parent("Антонина Павловна Адамова", "Елена Петровна Исмаилова").
parent("Игорь Александрович Федоров", "Сергей Игоревич Федоров").
parent("Игорь Александрович Федоров", "Анна Игоревна Федорова").
parent("Игорь Александрович Федоров", "Кирилл Игоревич Федоров").
parent("Павел Дмитриевич Шуст", "Алла Павловна Федорова").
parent("Елизавета Карловна Шуст", "Павел Дмитриевич Шуст").
parent("Карл Куранов", "Елизавета Карловна Шуст").
parent("Карл Куранов", "Даниил Карлович Куранов").
parent("Даниил Карлович Куранов", "Екатерина Данииловна Куранова").
parent("Даниил Карлович Куранов", "Леонид Даниилович Куранов").

%rules

divorced(X) :- 
	married(X),       % X is in married list
      	\+ spouse(X, _).  % but have no couple in spouse list


siblings(X, Y) :-
       	parent(Z, X), %Z is a parent of X%
       	parent(Z, Y), % Z is a parent of Y
	Y \= X.     % it's not the same person

grandparent(X, Y) :- 
	parent(X, Z), % X is a parent of Z
	parent(Z, Y).  % when Z is a parent of Y

half_siblings(S1, S2):-
	parent(P1, S1),  %P1 is parent of the first child
	spouse(P1, P2),  %P1 is P2 husband or wife
       	parent(P2, S2),  %find the second sibling, whose parent is P2
	S1 \= S2,        % S1 and S2 cannot be one person
       	P1 \= P2, 	 % parents also couldn't be one person
	not(parent(P2,S1)).  %the second parent can't be bio-parent of the first child )

spouse(X, Y) :- spouse(Y, X).
